Autodesk.Revit.UI.BrowserUtility.IsInFabricationRouteAndFillMode(Autodesk.Revit.DB.Document)
Tests if a document is currently in fabrication route and fill mode.
Remarks:
For public API is not supported in edit mode, so this method prefer to use only in internal programming.
document:
The document to test.
Returns:
True if the document is in fabrication route and fill, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.BrowserUtility.IsBrowserEnabled
Test if the API plugged in browser is enabled
Returns:
True if the API based browser is enabled, false otherwise.
Since:
2017